In [18]:
import numpy as np
import pandas as pd

In [19]:
TRAIN_SET_PATH = './datasets/Train_v2.csv'
TEST_SET_PATH = './datasets/Test_v2.csv'

In [20]:
df = pd.read_csv(TRAIN_SET_PATH)
df.head()

,country,year,uniqueid,bank_account,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
0,Kenya,2018,uniqueid_1,Yes,Rural,Yes,3,24,Female,Spouse,Married/Living together,Secondary education,Self employed
1,Kenya,2018,uniqueid_2,No,Rural,No,5,70,Female,Head of Household,Widowed,No formal education,Government Dependent
2,Kenya,2018,uniqueid_3,Yes,Urban,Yes,5,26,Male,Other relative,Single/Never Married,Vocational/Specialised training,Self employed
3,Kenya,2018,uniqueid_4,No,Rural,Yes,5,34,Female,Head of Household,Married/Living together,Primary education,Formally employed Private
4,Kenya,2018,uniqueid_5,No,Urban,No,8,26,Male,Child,Single/Never Married,Primary education,Informally employed

In [21]:
df.describe()

               year  household_size  age_of_respondent
count  23524.000000    23524.000000       23524.000000
mean    2016.975939        3.797483          38.805220
std        0.847371        2.227613          16.520569
min     2016.000000        1.000000          16.000000
25%     2016.000000        2.000000          26.000000
50%     2017.000000        3.000000          35.000000
75%     2018.000000        5.000000          49.000000
max     2018.000000       21.000000         100.000000

In [22]:
from sklearn.utils import shuffle
new_df = shuffle(df)

new_df.head()

,country,year,uniqueid,bank_account,location_type,cellphone_access,household_size,age_of_respondent,gender_of_respondent,relationship_with_head,marital_status,education_level,job_type
12805,Rwanda,2016,uniqueid_6738,No,Rural,Yes,6,51,Female,Spouse,Married/Living together,Primary education,Farming and Fishing
8669,Rwanda,2016,uniqueid_2602,No,Rural,Yes,8,36,Female,Spouse,Married/Living together,Primary education,Remittance Dependent
21827,Uganda,2018,uniqueid_405,No,Rural,Yes,11,53,Male,Head of Household,Married/Living together,Primary education,Self employed
459,Kenya,2018,uniqueid_460,Yes,Urban,Yes,3,30,Male,Head of Household,Married/Living together,Primary education,Self employed
8033,Rwanda,2016,uniqueid_1966,No,Rural,Yes,3,30,Female,Spouse,Married/Living together,Primary education,Self employed

In [23]:
train_data = new_df.copy()

In [25]:
train_data = train_data.drop(columns=['cellphone_access', 'household_size'])
y = train_data['bank_account']

In [26]:
y.head()

12805     No
8669      No
21827     No
459      Yes
8033      No
Name: bank_account, dtype: object

In [46]:
X = train_data.drop(columns=['bank_account', 'year'])
X['relationship'] = X['relationship_with_head'] + X['marital_status']

X = X.drop(columns=['relationship_with_head','marital_status'])

In [47]:
X.head()

,country,uniqueid,location_type,age_of_respondent,gender_of_respondent,education_level,job_type,relationship
12805,Rwanda,uniqueid_6738,Rural,51,Female,Primary education,Farming and Fishing,SpouseMarried/Living together
8669,Rwanda,uniqueid_2602,Rural,36,Female,Primary education,Remittance Dependent,SpouseMarried/Living together
21827,Uganda,uniqueid_405,Rural,53,Male,Primary education,Self employed,Head of HouseholdMarried/Living together
459,Kenya,uniqueid_460,Urban,30,Male,Primary education,Self employed,Head of HouseholdMarried/Living together
8033,Rwanda,uniqueid_1966,Rural,30,Female,Primary education,Self employed,SpouseMarried/Living together

In [48]:
from sklearn.preprocessing import LabelBinarizer

In [60]:
label_binarizer = LabelBinarizer()
y_train = label_binarizer.fit_transform(y)

In [66]:
from sklearn.feature_extraction import DictVectorizer
 
def encode_onehot(df, cols):
    vec = DictVectorizer()
    
    vec_data = pd.DataFrame(vec.fit_transform(df[cols].to_dict('records')).toarray())
    vec_data.columns = vec.get_feature_names()
    vec_data.index = df.index
    
    df = df.drop(cols, axis=1)
    df = df.join(vec_data)
    return df

In [67]:
X_train = encode_onehot(X, cols=X.columns)
X_train.shape

(23524, 8787)

In [53]:
y_train.shape

(23524, 1)